True if the "save to local" operation is occurring before "save to central"; false if after.
  Namespace:   Autodesk.Revit.DB.Events
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  Since:  2017 Subscription Update
 Syntax
  C#
public bool BeforeSaveToCentral { get; }
  Visual Basic
Public ReadOnly Property BeforeSaveToCentral As Boolean
	Get
  Visual C++
public:
property bool BeforeSaveToCentral {
	bool get ();
}
 See Also
  DocumentSaveToLocalProgessChangedEventArgs Class
  Autodesk.Revit.DB.Events Namespace